# Things to make mac more Linuxy or casks, which as mac only
brew "bash-completion"
brew "readline" # (.inputrc)
brew "watch"

brew "cassandra" # only supports macOS

# Tools used by Hammerspoon Lua files
brew "blueutil"

# Things to make it easier to automatically manage things on the mac
brew "dockutil"

# Casks
cask_args appdir: '~/Applications'
cask "google-cloud-sdk"

cask "hammerspoon"
cask "stats"
cask "firefox"
cask "google-chrome"
cask "atom"
cask "jetbrains-toolbox"
cask "drawio"
cask "libreoffice"
cask "iterm2"
cask "keeweb"

# Needed by font-liberation-mono-for-powerline, for some reason
brew "svn"
tap "homebrew/cask-fonts"
cask "font-liberation-mono-for-powerline"
