# Java tools
brew "maven"

# Go tools
brew "go"

# Tools used to install dot files
brew "stow"

# Tools used by zsh plugins
brew "fzf"

# General command line tools
brew "dive" # Tool used to browse the contents of Docker images
brew "jq" # Manipulating JSON
brew "git"
brew "htop"
brew "tree"
brew "curl"
brew "direnv" # Per-directory environment configuration
brew "pandoc" # Generating man from markdown
brew "ipcalc" # Working out CIDR ranges
brew "powerline-go" # Advanced command prompt

# Tools for interacting with the cloud
brew "terraform"
brew "terragrunt"
brew "packer"
brew "ansible"
brew "awscli"
brew "azure-cli"

# Tools for Kubernetes
brew "kubernetes-cli" # kubectl
brew "kubectx" # Switch between contexts
brew "stern" # Tail multiple pods
brew "aws-iam-authenticator"

# Database tools
brew "pgcli" # PostgreSQL
brew "mysql-client"
brew "vault"
