cask_args appdir: '~/Applications'

brew "bash-completion"

# Java tools
brew "maven"

# Go tools
brew "go"

# Tool used to install dot files
brew "stow"

# General command line tools
brew "dive" # Tool used to browse the contents of Docker images
brew "readline" # (.inputrc)
brew "jq" # Manipulating JSON
brew "git"
brew "htop"
brew "tree"
brew "curl"
brew "watch"
brew "direnv" # Per-directory environment configuration
brew "pandoc" # Generating man from markdown
brew "ipcalc" # Working out CIDR ranges
brew "powerline-go" # Advanced command prompt

# Tools for interacting with the cloud
brew "terraform"
brew "terragrunt"
brew "packer"
brew "ansible"
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Tools for Kubernetes
brew "kubernetes-cli"
brew "kubectx" # Switch between contexts
brew "stern" # Tail multiple pods
brew "aws-iam-authenticator"

# UI tools
tap "homebrew/cask-fonts"
cask "font-liberation-mono-for-powerline"
cask "hammerspoon"
cask "menumeters"
cask "google-chrome"
cask "atom"
cask "jetbrains-toolbox"
cask "drawio"
cask "libreoffice"

# Database tools
brew "pgcli" # PostgreSQL
brew "mysql-client"
brew "cassandra"
brew "vault"

# Tools used by Hammerspoon Lua files
brew "blueutil"
