cask_args appdir: '~/Applications'

brew "bash-completion"

# Tool used to install dot files
brew "stow"

# Tool used to browse the contents of Docker images
brew "dive"

# General command line tools
brew "readline" # (.inputrc)
brew "jq"
brew "git"
brew "htop"
brew "tree"
brew "curl"
brew "watch"
brew "direnv"
brew "pandoc"
brew "ipcalc"
brew "powerline-go"

# Tools for interacting with the cloud
brew "terraform"
brew "terragrunt"
brew "packer"
brew "ansible"
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Tools for Kubernetes
brew "kubernetes-cli"
brew "kubectx" # Switch between contexts
brew "stern" # Tail multiple pods
brew "aws-iam-authenticator"

# UI tools
tap "homebrew/cask-fonts"
cask "font-liberation-mono-for-powerline"
cask "hammerspoon"
cask "menumeters"
cask "google-chrome"
cask "atom"
cask "jetbrains-toolbox"
cask "docker"
cask "drawio"
cask "libreoffice"

# Database tools
brew "pgcli" # PostgreSQL
brew "mysql-client"
brew "neo4j"
brew "cassandra"
brew "vault"

# Java tools
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk11"
brew "maven"

# Go tools
brew "go"

# Tools used by Hammerspoon Lua files
brew "blueutil"
